note_for_emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>note_for_emacs</title>
<!-- 2016-05-08 日 21:58 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="alex" />
<link rel="stylesheet" type="text/css" href="emacs-china.css"/>
</head>
<body>
<div id="content">
<h1 class="title">note_for_emacs</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. emacs lisp</a>
<ul>
<li><a href="#sec-1-1">1.1. setq and setq-default 的区别</a></li>
<li><a href="#sec-1-2">1.2. 不保留备份文件</a></li>
<li><a href="#sec-1-3">1.3. 保持 org 语法高亮</a></li>
<li><a href="#sec-1-4">1.4. 设置选词副高</a></li>
<li><a href="#sec-1-5">1.5. add-hook 的作用</a></li>
<li><a href="#sec-1-6">1.6. 设置 elpa</a></li>
<li><a href="#sec-1-7">1.7. 设置缩写</a></li>
<li><a href="#sec-1-8">1.8. 一个 lisp 小例子(全文缩进的办法)</a></li>
<li><a href="#sec-1-9">1.9. emacs 的目录 mode</a></li>
<li><a href="#sec-1-10">1.10. Org-mode 文学编程</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> emacs lisp</h2>
<div class="outline-text-2" id="text-1">
</div><div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> setq and setq-default 的区别</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Emacs 中有些变量是 <code>buffer-local</code> 修饰的, 这意味着每一个 buffer 都有一个对应的值, 那么 setq 修改的就是 buffer 对应的值, setq-default 修改的是全局的值
</p>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> 不保留备份文件</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(setq-default make-backup-files nil)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> 保持 org 语法高亮</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F92672;">require</span> '<span style="color: #AE81FF;">org</span>)
(setq org-src-fontify-natively t)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> 设置选词副高</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(delete-selection-mode t)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> add-hook 的作用</h3>
<div class="outline-text-3" id="text-1-5">
</div><div id="outline-container-sec-1-5-1" class="outline-4">
<h4 id="sec-1-5-1"><span class="section-number-4">1.5.1</span> 事例</h4>
<div class="outline-text-4" id="text-1-5-1">
<div class="org-src-container">

<pre class="src src-emacs-lisp"><span style="color: #75715E;">;; </span><span style="color: #75715E;">hook &#23601;&#26159;&#38057;&#23376;&#30340;&#24847;&#24605;, mains &#25171;&#24320; emacs-lisp-mode-hook &#27169;&#24335;&#26102; &#36816;&#34892;&#38057;&#23376;, &#32780;&#38057;&#23376;&#28155;&#21152;&#20102; show-paren-mode </span>
(add-hook 'emacs-lisp-mode-hook 'show-paren-mode)
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> 设置 elpa</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F92672;">require</span> '<span style="color: #AE81FF;">cl</span>)
(<span style="color: #F92672;">when</span> (&gt;= emacs-major-version 24)
  (<span style="color: #F92672;">require</span> '<span style="color: #AE81FF;">package</span>)
  (package-initialize)
  (add-to-list 'package-archives '(<span style="color: #E6DB74;">"melpa"</span> . <span style="color: #E6DB74;">"http://melpa.org/packages/"</span>) t))


(<span style="color: #F92672;">defvar</span> <span style="color: #FD971F;">alex-chen-packages</span> '(
                             auto-complete
                             ) <span style="color: #75715E;">"Default packages"</span>)
(setq package-selected-packages alex-chen-packages)
(<span style="color: #F92672;">defun</span> <span style="color: #A6E22E;">alex-chen-packages-installed-p</span> ()
  (loop for pkg alex-chen-packages
        when (not (package-installed-p pkg)) do (return nil)
        finally (return t)))
(<span style="color: #F92672;">unless</span> (alex-chen-packages-installed-p)
  (message <span style="color: #E6DB74;">"%s"</span> <span style="color: #E6DB74;">"Refreshing package database..."</span>)
  (package-refresh-contents)
  (<span style="color: #F92672;">dolist</span> (pkg alex-chen-packages)
    (<span style="color: #F92672;">when</span> (not (package-installed-p pkg))
      (package-install pkg))))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> 设置缩写</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-emacs-lisp">(abbrev-mode t)
(define-abbrev-table 'global-abbrev-table '(
                                            <span style="color: #75715E;">;; </span><span style="color: #75715E;">&#38656;&#35201;&#34917;&#20840;&#30340;&#20869;&#23481;</span>
                                            (<span style="color: #E6DB74;">"ac"</span> <span style="color: #E6DB74;">"Alex-chen"</span>)
                                            ))
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> 一个 lisp 小例子(全文缩进的办法)</h3>
<div class="outline-text-3" id="text-1-8">
<p>
全文缩进方法
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(interactive)
(indent-region (point-min) (point-max)
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-9" class="outline-3">
<h3 id="sec-1-9"><span class="section-number-3">1.9</span> emacs 的目录 mode</h3>
<div class="outline-text-3" id="text-1-9">
<p>
在目录 mode 下, 
</p>
<ol class="org-ol">
<li>按 <code>+</code> 号可以创建目录
</li>
<li><code>C-x C-f</code> 来创建文件
</li>
<li><code>g</code> 刷新
</li>
<li><code>C</code> copy file
</li>
<li><code>d</code> delete file
</li>
<li><code>R</code> rename file
</li>
<li><code>x</code> 执行标记
</li>
</ol>
</div>
</div>
<div id="outline-container-sec-1-10" class="outline-3">
<h3 id="sec-1-10"><span class="section-number-3">1.10</span> Org-mode 文学编程</h3>
<div class="outline-text-3" id="text-1-10">
<p>
添加
</p>
<div class="org-src-container">

<pre class="src src-emacs-lisp">(<span style="color: #F92672;">require</span> '<span style="color: #AE81FF;">org-install</span>)
(<span style="color: #F92672;">require</span> '<span style="color: #AE81FF;">ob-tangle</span>)
(org-babel-load-file (expand-file-name <span style="color: #E6DB74;">"alex-chen.org"</span> user-emacs-directory))
</pre>
</div>

<p>
随后将配置写入 alex-chen.org 文件中即可.
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: alex</p>
<p class="date">Created: 2016-05-08 日 21:58</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.5.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
